// search index for WYSIWYG Web Builder
var database_length = 0;

function SearchPage(url, title, keywords, description)
{
   this.url = url;
   this.title = title;
   this.keywords = keywords;
   this.description = description;
   return this;
}

function SearchDatabase()
{
   database_length = 0;
   this[database_length++] = new SearchPage("index.html", "Музичне мистецтво. 5 клас. ", " ІНТЕРАКТИВНИЙ ЕЛЕКТРОННИЙ ДОДАТОК    Запрошуємо в чарівний світ музичного мистецтва!  Цей е-додаток допоможе вам навчатися легко, цікаво та ефективно Що на вас чекає  Інфографіка уроку  все й одразу Медіатека  переглядайте відеоуроки, слухайте твори мистецтва Інтерактивні вправи  закріплюйте знання через ігри Музика єднає людей!     © 2026 ТОВ \"Генеза\"   ", "");
   this[database_length++] = new SearchPage("p1.html", "Музичне мистецтво. 5 клас. ", "ВСТУП  РОЗДIЛ I ЛЮДИНА I ДОВКIЛЛЯ  МЕЛОДIЇ ПРИРОДИ ТА БАРВИ ПОЧУТТIВ   ", "");
   this[database_length++] = new SearchPage("p2.html", "Музичне мистецтво. 5 клас. ", "ВСТУП МУЗИКА В ЖИТТI ЛЮДИНИ  Відеоурок  ІНТЕРАКТИВНІ ВПРАВИ  Музика навколо  НАЙВАЖЛИВІШЕ   Тестове завдання  Споглядаємо  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p3.html", "Музичне мистецтво. 5 клас. ", "ВСТУП ЯК НАРОДИЛАСЯ МУЗИКА  ІНТЕРАКТИВНІ ВПРАВИ  Тривалість звуків і пауз  Тестове завдання  НАЙВАЖЛИВІШЕ   Відеоурок  Споглядаємо  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("pro.html", "Музичне мистецтво. 5 клас. ", "                                                           Про інтерактивний електронний додаток  Цей е-додаток створено для того, щоб урізноманітнити навчання за підручником, зробити його ефективнішим і цікавішим Контент подано за темами відповідно до змісту підручника   Тут ви можете  ознайомитися з текстом підручника  стисло зрозуміти матеріал теми за допомогою інфографіки  переглянути навчальні та цікаві відео, послухати музичні твори, зображення творів мистецтва  перевірити свої знання за допомогою інтерактивних вправ  Системні вимоги Операційна система — Windows 7 чи пізніші версії, Linux, ChromeOS, macOS, Android, iOS Оперативна пам’ять — 4 ГБ і більше Web browser — усі, що підтримують HTML5 Місце на жорсткому диску  для роботи офлайн  — 2 ГБ і більше  Uicons Flaticon   ", "");
   this[database_length++] = new SearchPage("p2p2.html", "Музичне мистецтво. 5 клас. ", "Марчін Півоварські  Marcin Piwowarski   Катя Дудник   ", "");
   this[database_length++] = new SearchPage("p2p3.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p3p3.html", "Музичне мистецтво. 5 клас. ", "Наскельний живопис Франція Печера Ласко   ", "");
   this[database_length++] = new SearchPage("p3p4.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p4.html", "Музичне мистецтво. 5 клас. ", "РОЗДIЛ I ЛЮДИНА I ДОВКIЛЛЯ  МЕЛОДIЇ ПРИРОДИ ТА БАРВИ ПОЧУТТIВ ВІД НАРОДНИХ ДЖЕРЕЛ  ІНТЕРАКТИВНІ ВПРАВИ  Кросворд  Пісенні жанри  НАЙВАЖЛИВІШЕ   Відеоурок  Споглядаємо  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p4p4.html", "Музичне мистецтво. 5 клас. ", "Марія Приймаченко Лежень ліг під яблуню  Марфа Тимченко Засвіт встали козаченьки  Михайло Білас Вертеп  Михайло Білас Гаївки   ", "");
   this[database_length++] = new SearchPage("p4p5.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p5.html", "Музичне мистецтво. 5 клас. ", "СВІТ ВОКАЛЬНОЇ МУЗИКИ  ІНТЕРАКТИВНІ ВПРАВИ  Голос чи інструмент?  Пошук зниклих нот  НАЙВАЖЛИВІШЕ   Відеоурок  Споглядаємо  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p5p5.html", "Музичне мистецтво. 5 клас. ", "Альберт Розенбум Урок с піву  Ангели  дерев'яна статуетка    ", "");
   this[database_length++] = new SearchPage("p5p6.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p6.html", "Музичне мистецтво. 5 клас. ", "ІНТОНАЦІЯ В МУЗИЦІ  ІНТЕРАКТИВНІ ВПРАВИ  Секрети музичної мови  Штрих  НАЙВАЖЛИВІШЕ   Відеоурок  Споглядаємо  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p6p6.html", "Музичне мистецтво. 5 клас. ", "Катя Дудник Таре Туаре  Людвіг Нойштеттер Дитячі забави  Тимолеон Марі Лобришон Секрет   ", "");
   this[database_length++] = new SearchPage("p6p7.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p7.html", "Музичне мистецтво. 5 клас. ", "МУЗИКА I ДОВКІЛЛЯ  ІНТЕРАКТИВНІ ВПРАВИ  Музична палітра образів  Словничок хорової гармонії  НАЙВАЖЛИВІШЕ   Відеоурок  Споглядаємо  Дивимося та слухаємо  Тестове завдання   ", "");
   this[database_length++] = new SearchPage("p7p7.html", "Музичне мистецтво. 5 клас. ", "Франс Снейдерс   ", "");
   this[database_length++] = new SearchPage("p7p8.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p8.html", "Музичне мистецтво. 5 клас. ", "МОВА МУЗИЧНИХ ПОЧУТТІВ  ІНТЕРАКТИВНІ ВПРАВИ  Гра «Впізнай манеру співу»  Склади пазл  НАЙВАЖЛИВІШЕ   Відеоурок  Споглядаємо  Дивимося та слухаємо  ПРОЄКТ   ", "");
   this[database_length++] = new SearchPage("p8p8.html", "Музичне мистецтво. 5 клас. ", "Франс Галс Два хлопчики співають  Celia Bompiani - Battaglia Im Maleratelier   ", "");
   this[database_length++] = new SearchPage("p8p9.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p8p10.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p8p11.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p9.html", "Музичне мистецтво. 5 клас. ", "СВІТ ІНСТРУМЕНТАЛЬНОЇ МУЗИКИ  ІНТЕРАКТИВНІ ВПРАВИ  Музичний конструктор  сім’ї інструментів»  Шифрувальник музичної мови  НАЙВАЖЛИВІШЕ   Відеоурок  Споглядаємо  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p9p9.html", "Музичне мистецтво. 5 клас. ", "Ганс Мемлінг  Цанко Лавренов Нічна музика  Lily Новий Орлеан  Юліус Генрікус Квінкхард   ", "");
   this[database_length++] = new SearchPage("p9p10.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p10.html", "Музичне мистецтво. 5 клас. ", "СИМФОНІЧНИЙ ОРКЕСТР І ЙОГО ТАЄМНИЦІ  ІНТЕРАКТИВНІ ВПРАВИ  Впізнай голос інструмента  Таємниці партитури та диригента  НАЙВАЖЛИВІШЕ   Відеоурок  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p10p10.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p11.html", "Музичне мистецтво. 5 клас. ", "СВIТ ДУХОВИХ ТА УДАРНИХ ІНСТРУМЕНТІВ  ІНТЕРАКТИВНІ ВПРАВИ  Ритмічна родина  Музика навколо нас  НАЙВАЖЛИВІШЕ   Відеоурок  Дивимося та слухаємо  Споглядаємо   ", "");
   this[database_length++] = new SearchPage("p11p11.html", "Музичне мистецтво. 5 клас. ", "Скульптура у Сафарі-парк  Скульптура у Бенсон-парк  США   Джеф Нишінака Скульптура   ", "");
   this[database_length++] = new SearchPage("p11p12.html", "Музичне мистецтво. 5 клас. ", " ", "");
   this[database_length++] = new SearchPage("p12.html", "Музичне мистецтво. 5 клас. ", "ЧАРІВНІ ЗВУКИ ТА НЕЗВИЧАЙНІ ІНСТРУМЕНТИ  ІНТЕРАКТИВНІ ВПРАВИ  Інструментальна мозаїка  Вікторина «Уважний музикант»  НАЙВАЖЛИВІШЕ   Відеоурок  Дивимося та слухаємо  Споглядаємо   ", "");
   this[database_length++] = new SearchPage("p12p12.html", "Музичне мистецтво. 5 клас. ", "Мішель Мішо Октет на репетиції  Пабло Пікассо «Скрипка та гітара»   ", "");
   this[database_length++] = new SearchPage("p12p13.html", "Музичне мистецтво. 5 клас. ", " ", "");
   return this;
}
